{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        },
	"ruleId": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "metadata": {
        "description": "The unique guid for this Analytics Rule"
				}
    }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/', parameters('ruleId'))]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', parameters('ruleId'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "[WASOC-Intelligence] Phishing email potentially delivered to user mailbox",
                "description": "phishing-001\nThe rules detect emails that matched Indicator of Compromise (IOC) from WASOC Threat Intelligence feed. The email was not blocked and could have been potentially in the user's inbox.",
                "severity": "Medium",
                "enabled": true,
                "query": "//WASOC-Intelligence phishing-001\nlet dt_lookBack = 1h; //email-events lookback period\nlet ioc_lookBack = 14d; //Threat Intel lookback period\nlet EmailEvents_ = workspace(\"23f5b860-1ab0-4876-930c-4a1bda91781a\").EmailEvents \n| where TimeGenerated >= ago(dt_lookBack) and isnotempty(SenderMailFromAddress) and  DeliveryAction !has \"Blocked\" and SenderMailFromAddress <> \"<>\"\n| where EmailDirection == \"Inbound\"\n| extend RecipientEmailAddress = tolower(RecipientEmailAddress)\n| project TimeGenerated, DeliveryAction, DeliveryLocation, EmailDirection, NetworkMessageId, RecipientEmailAddress, SenderMailFromAddress, SenderFromAddress, SenderMailFromDomain, SenderIPv4, Subject, To\n| project-rename  EmailEvents_TimeGenerated = TimeGenerated\n;\nlet TI = ThreatIntelIndicators\n| where TimeGenerated >= ago(ioc_lookBack)\n//Use only WASOC-Government-ISAC feed\n| where SourceSystem == \"WASOC-Government-ISAC\" and Tags contains \"phishing\"\n| extend IndicatorType = replace(@\"\\[|\\]|\\\"\"\", \"\", tostring(split(ObservableKey, \":\", 0)))\n| where IndicatorType == \"email-addr\"\n| extend EmailSenderAddress = ObservableValue\n| extend EmailSourceDomain = substring(EmailSenderAddress, indexof(EmailSenderAddress, \"@\") + 1, strlen(EmailSenderAddress) - indexof(EmailSenderAddress, \"@\") - 1)\n| extend TrafficLightProtocolLevel = tostring(parse_json(AdditionalFields).TLPLevel)\n| extend TI_EmailAddress = tolower(EmailSenderAddress)\n| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id, ObservableValue\n| where IsActive and (ValidUntil > now() or isempty(ValidUntil));\nunion isfuzzy=true\n(EmailEvents_ // Join based on SenderMailFromAddress\n| join kind=inner\n(\nTI\n) on $left.SenderMailFromAddress == $right.ObservableValue),\n(EmailEvents_ // Join based on SenderFromAddress\n| join kind=inner\n(\nTI\n) on $left.SenderFromAddress == $right.ObservableValue)\n| where EmailEvents_TimeGenerated < ValidUntil\n| extend Description = tostring(parse_json(Data).description)\n| extend ActivityGroupNames = extract(\"ActivityGroup:([^,]+)\", 1, tostring(parse_json(Data).labels))\n| project EmailEvents_TimeGenerated, Description, Id, ValidUntil, Confidence, SenderMailFromDomain, RecipientEmailAddress, SenderMailFromAddress,SenderFromAddress, Subject, Type, ObservableValue, TrafficLightProtocolLevel, DeliveryAction, DeliveryLocation, EmailDirection, NetworkMessageId\n| extend Name = tostring(split(RecipientEmailAddress, '@', 0)[0]), UPNSuffix = tostring(split(RecipientEmailAddress, '@', 1)[0])\n| extend timestamp = EmailEvents_TimeGenerated",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "InitialAccess"
                ],
                "techniques": [
                    "T1566"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT1H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "[WASOC-Intelligence] Phishing email potentially delivered to user's mailbox, sent by {{ObservableValue}}",
                    "alertDescriptionFormat": "The rules detect incoming emails that matched IOC from WASOC Threat Intelligence feed. The email was not blocked and may have been delivered to the user's inbox.\n<br>\nTLP: {{TrafficLightProtocolLevel}} \n<br>\nIOC Description: {{Description}} \n<br>\nIOC Value: {{ObservableValue}} ",
                    "alertDynamicProperties": []
                },
                "customDetails": {
                    "Description": "Description"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "RecipientEmailAddress"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "Name"
                            },
                            {
                                "identifier": "UPNSuffix",
                                "columnName": "UPNSuffix"
                            }
                        ]
                    },
                    {
                        "entityType": "Mailbox",
                        "fieldMappings": [
                            {
                                "identifier": "MailboxPrimaryAddress",
                                "columnName": "RecipientEmailAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "MailMessage",
                        "fieldMappings": [
                            {
                                "identifier": "Recipient",
                                "columnName": "RecipientEmailAddress"
                            },
                            {
                                "identifier": "NetworkMessageId",
                                "columnName": "NetworkMessageId"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}